{
    "_default": {
        "1": {
            "name": "Bacon Wrapped Water Chestnuts",
            "instructions": "Marinate the water chestnuts in soy sauce for 1 hour.\nDrain.\nRoll each chestnut in the brown sugar.\nWrap each chestnut with a piece of bacon.\nSecure with a toothpick.\nArrange on a cake rack in a shallow baking pan.\nBake at 400 degrees F for about 30 minutes or until golden brown.\nDrain on paper towels.\nNOTE: This can be prepared ahead of time and stored in refrigerator until ready to bake.",
            "time": "1h 30m",
            "ingredients": "1 (8 ounce) can water chestnuts, drained\n1/4 cup soy sauce\n1/4 cup brown sugar\n8 slices bacon, cut in half crosswise",
            "yields": "16 servings",
            "url": "https://www.geniuskitchen.com/recipe/bacon-wrapped-water-chestnuts-33330"
        },
        "2": {
            "name": "Best Chocolate Chip Cookie Recipe",
            "instructions": "Note: This dough requires chilling.\n\nPlace melted butter in the bowl of a stand mixer fitted with the paddle attachment (or a large bowl if using a hand mixer). Add granulated and brown sugars and mix on low speed until the mixture is smooth. Mix in egg and vanilla extract and mix on medium speed until combined.\n\nMix in baking soda and salt, then slowly mix in flour and mix just until the batter is smooth and comes together. Be sure to scrape the sides of the bowl during mixing. Slowly mix in chocolate chips.\n\nLine a cookie sheet with a silicone baking mat or parchment paper. Scoop 2 tablespoon balls of dough onto the cookie sheet. Spacing doesn’t matter because you will be chilling the dough. Cover with plastic wrap and chill for at least 2 hours.\n\nPreheat oven to 350°F. Line a second cookie sheet with parchment paper or a silicone baking mat.\n\nRemove the chilled cookie dough balls from the refrigerator and space them 2-inches apart on the cookie sheets. Bake (2 tablespoon sized cookies) for 11-15 minutes, or until the edges are a light golden and the tops are no longer glossy. Let cool on the cookie sheets at least 10 minutes before removing.",
            "time": "30m",
            "ingredients": "1/2 cup (113g) unsalted butter, melted\n1/3 cup (66 g) granulated sugar\n1/2 cup (104g) light brown sugar, packed\n1 large egg\n1 teaspoon (5ml) vanilla extract\n1/2 teaspoon baking soda\n1/2 teaspoon salt\n1 1/2 cups (186g) all-purpose flour\n1 1/2 cups (255g) chocolate chips (semi-sweet or milk)\n",
            "yields": "24 cookies",
            "url": "https://www.crazyforcrust.com/best-chocolate-chip-cookie-recipe/"
        },
        "3": {
            "name": "Fresh Rhubarb Pie",
            "instructions": "Preheat oven to 450 degrees F (230 degrees C).\n\nCombine sugar and flour. Sprinkle 1/4 of it over pastry in pie plate. Heap rhubarb over this mixture. Sprinkle with remaining sugar and flour. Dot with small pieces of butter. Cover with top crust.\n\nPlace pie on lowest rack in oven. Bake for 15 minutes. Reduce oven temperature to 350 degrees F (175 degrees C), and continue baking for 40 to 45 minutes. Serve warm or cold.",
            "time": "1h 30m",
            "ingredients": "4 cups chopped rhubarb\n1 1/3 cups white sugar\n6 tablespoons all-purpose flour\n1 tablespoon butter\n1 recipe pastry for a 9 inch double crust pie",
            "yields": "8 servings",
            "url": "https://www.allrecipes.com/recipe/12316/fresh-rhubarb-pie/"
        }
    }
}